
/*
1.链表常见的必须掌握
2.栈和队列  （leetcode 232,225,20）
    1.用两个栈实现队列 
    2.用两个队列实现栈
    3.判断字符串括号是否匹配
    4.判断出栈顺序是否正确
3.各种常见排序算法
    1.快排及快排的优化
    2.堆排
    3.冒泡/选择
4.堆的应用
    1.返回动态数据流中的第k大数字 （leetcode 703） (小根堆)
    2.滑动窗口 （leetcode 239）
5.哈希算法
给两个字符串，判断是否为Anagram  (leetcode 242)
6.树
    1.判断一颗树是否为二叉搜索树  (leetcode 98)
    2.求最低公共祖先  （leetcode 235，236）
    3.
7.位运算
8.动态规划
    买卖股票的最佳时间 DFS （leetcode 122）
    三角形的最短路径 （leetcode 120）
    乘积最大的连续子序列  （leetcode 152）
    最长上升自序列  （leetcode 300） 自序列可以不相邻，连续子序列才需要
    零钱兑换  最少需要多少个硬币 可以得到给的面值(leetcode 322)
    编辑最短距离 （单词1要变成单词2，最少需要多少步）（insert, delete, replace） （leetcode (72)

    (leetcode 242)
9.实现缓存替换机制 LRU cache





*/